{
  "posts": [
    {
      "post_title": "And so it begin...HTML and CSS",
      "post_author": "Stephan Maree",
      "post_date": "2018-05-08",
      "post_article": "<p>I watched The Matrix when I was ten. Needless to say, I thought programmers were the coolest people on Earth. Fast forward 16 years and I'm sitting in Vietnam researching \"the best programming languages\". Mistake no.1. I spent a week trying to figure out which programming language is the best/highest demand/easiest to learn, the list goes on. Eventually I realised it all starts with HTML and CSS.</p><p>Still not entirely sure of how to approach \"programming\",&nbsp; I enrol in a free online course to see if I've got what it takes. Ten minutes in and I have hideous blue background and enormous heading text reading \"Hello World\". My first thought was, \"Move over Neo, Stephan is in town. Genius!\" Mistake no.2. I soon realised a chimpanzee could have created my blue masterpiece.</p><p>My online education gained momentum. Things starting making sense, ah ha moments. Ah ha moment no.1, HTML isn't a programming language, it's a markup language. You give basic English instruction to create elements which you can style/color/shape with CSS. HTML is a markup language, Hypertext Markup Language to be exact. CSS is a style sheet language, you style your HTML elements.&nbsp; These two are peanut butter and jam, pancakes and cinnamon sugar, sunshine and beer, the one needs the other.</p><p><br></p><p>Sooner than later I had built a static webpage . I was on my way, the red pill or the blue. How far down the rabbit hole did I want to go.</p>",
      "image_url": "https://mejorvendedor.files.wordpress.com/2013/09/decision-matrix.png?w=550",
      "id": 1
    },
    {
      "post_title": "Hello this post needs to edit",
      "post_author": "Editiiing",
      "post_date": "2018-02-02",
      "post_article": "<p>This post is lekkerder</p>",
      "image_url": "",
      "id": 2
    }
  ],
  "comments": [
    {
      "username": "blogMaster",
      "comment": "This blog is duidelik",
      "postId": "3",
      "id": 1
    },
    {
      "username": "Stephan",
      "comment": "hellooooooo",
      "postId": "6",
      "id": 2
    },
    {
      "username": "jhsadgfljhsgdf",
      "comment": "samdfhblskdfhbskdjfbhskdjhf",
      "postId": "3",
      "id": 3
    },
    {
      "username": "asdasdasd",
      "comments": "asdsadasdasd",
      "postId": "6",
      "id": 4
    }
  ],
  "profile": {
    "name": "typicode"
  },
  "users": [
    {
      "firstname": "lisa",
      "lastname": "van zyl",
      "email": "lisa.v.zyl@gmail.com",
      "password": "stellenbosch",
      "id": 1
    }
  ]
}